redis_test/redis-benchmark-log/redis-benchmark-local.log
====== PING_INLINE ======
  100000 requests completed in 1.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

86.28% <= 1 milliseconds
99.65% <= 2 milliseconds
99.92% <= 3 milliseconds
99.96% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
55710.31 requests per second

====== PING_BULK ======
  100000 requests completed in 1.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

94.82% <= 1 milliseconds
99.90% <= 2 milliseconds
99.96% <= 3 milliseconds
99.98% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
59988.00 requests per second

====== SET ======
  100000 requests completed in 1.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

80.96% <= 1 milliseconds
99.05% <= 2 milliseconds
99.71% <= 3 milliseconds
99.83% <= 4 milliseconds
99.92% <= 5 milliseconds
99.93% <= 6 milliseconds
99.93% <= 7 milliseconds
99.94% <= 8 milliseconds
99.94% <= 9 milliseconds
99.95% <= 10 milliseconds
99.97% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 14 milliseconds
100.00% <= 24 milliseconds
52083.34 requests per second

====== GET ======
  100000 requests completed in 1.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

93.32% <= 1 milliseconds
99.92% <= 2 milliseconds
99.97% <= 3 milliseconds
99.98% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
59737.16 requests per second

====== INCR ======
  100000 requests completed in 1.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

93.83% <= 1 milliseconds
99.93% <= 2 milliseconds
99.94% <= 3 milliseconds
99.95% <= 4 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 12 milliseconds
59488.40 requests per second

====== LPUSH ======
  100000 requests completed in 1.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

86.77% <= 1 milliseconds
99.93% <= 2 milliseconds
99.98% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
55710.31 requests per second

====== LPOP ======
  100000 requests completed in 1.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

84.14% <= 1 milliseconds
99.78% <= 2 milliseconds
99.91% <= 3 milliseconds
99.93% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 14 milliseconds
54734.54 requests per second

====== SADD ======
  100000 requests completed in 1.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

91.76% <= 1 milliseconds
99.89% <= 2 milliseconds
99.95% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
58139.54 requests per second

====== SPOP ======
  100000 requests completed in 1.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.23% <= 1 milliseconds
99.96% <= 2 milliseconds
99.98% <= 3 milliseconds
99.99% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
60642.81 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.81 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

85.47% <= 1 milliseconds
99.90% <= 2 milliseconds
99.97% <= 3 milliseconds
99.98% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 12 milliseconds
55157.20 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 2.90 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

73.84% <= 1 milliseconds
99.81% <= 2 milliseconds
99.96% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 4 milliseconds
34423.41 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 7.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
94.49% <= 2 milliseconds
99.76% <= 3 milliseconds
99.94% <= 4 milliseconds
99.96% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 10 milliseconds
100.00% <= 10 milliseconds
13561.16 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 9.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
15.21% <= 2 milliseconds
99.61% <= 3 milliseconds
99.91% <= 4 milliseconds
99.94% <= 5 milliseconds
99.96% <= 6 milliseconds
99.99% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
10402.58 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 10.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.05% <= 2 milliseconds
80.83% <= 3 milliseconds
99.74% <= 4 milliseconds
99.83% <= 5 milliseconds
99.88% <= 6 milliseconds
99.92% <= 7 milliseconds
99.95% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 11 milliseconds
9345.79 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.07 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

69.52% <= 1 milliseconds
99.78% <= 2 milliseconds
99.87% <= 3 milliseconds
99.90% <= 4 milliseconds
99.93% <= 5 milliseconds
99.95% <= 8 milliseconds
99.95% <= 17 milliseconds
99.95% <= 18 milliseconds
99.99% <= 19 milliseconds
100.00% <= 19 milliseconds
48285.85 requests per second